{
  "2025-04-28-artigo-1.json": {
    "intro": "Já perdi as contas de quantas vezes vi desenvolvedores tropeçarem em __TEMATICA__..."
  },
  "2025-04-27-artigo-2.json": {
    "intro": "Essa notícia me fez refletir sobre como o mercado ainda lida mal com __TEMATICA__."
  },
  "2025-04-30-desvendando-o-mundo-da-derivacao-automatica-esparsa": {
    "intro": "A discussão sobre An illustrated guide to automatic sparse differentiation voltou à tona, e acredito que precisamos falar sobre isso com mais seriedade."
  },
  "2025-04-30-chatgpt-a-revolucao-na-busca-de-informacoes-online": {
    "intro": "Em um projeto antigo, enfrentei um problema parecido com o que essa notícia levanta...",
    "data": "2025-04-30"
  },
  "2025-04-30-performance-em-sistemas-desafios-e-estrategias-para-otimizacao": {
    "intro": "A discussão sobre Performance optimization is hard because it's fundamentally a brute-force task voltou à tona, e acredito que precisamos falar sobre isso com mais seriedade.",
    "data": "2025-04-30"
  },
  "2025-04-30-o-poder-oculto-da-sycophancy-no-universo-do-gpt-4o": {
    "intro": "Existe uma armadilha técnica que muitos ignoram quando falamos de Sycophancy in GPT-4o.",
    "data": "2025-04-30"
  },
  "2025-04-30-defendendo-uma-empresa-de-seguranca-cibernetica-desafios-e-estrategias-na-pratica": {
    "intro": "Sempre que vejo discussões sobre What It Takes to Defend a Cybersecurity Company from Today's Adversaries, lembro de uma situação real em produção...",
    "data": "2025-04-30"
  },
  "2025-04-30-hackeando-a-hacker-news-desvendando-os-segredos-dos-sistemas-modernos": {
    "intro": "Você já parou para pensar no impacto real de You Wouldn't Download a Hacker News nos sistemas modernos?",
    "data": "2025-04-30"
  },
  "2025-04-30-linux-e-excel-a-combinacao-que-vai-revolucionar-sua-produtividade": {
    "intro": "Tenho visto muita gente tratando Linux in Excel como algo simples — mas a realidade é bem diferente.",
    "data": "2025-04-30"
  },
  "2025-04-30-o-dilema-das-gemeas-do-meu-fermento-natural": {
    "intro": "Existe uma armadilha técnica que muitos ignoram quando falamos de My sourdough starter has twins.",
    "data": "2025-04-30"
  },
  "2025-04-30-explorando-a-aleatoriedade-nos-llms-desvendando-um-misterio-tecnico": {
    "intro": "Tenho visto muita gente tratando Can LLMs do randomness? como algo simples — mas a realidade é bem diferente.",
    "data": "2025-04-30"
  },
  "2025-04-30-a-revolucao-da-inteligencia-artificial-os-principais-eventos-no-campo": {
    "intro": "A discussão sobre AI TIMLINE – All prominent events in the field voltou à tona, e acredito que precisamos falar sobre isso com mais seriedade.",
    "data": "2025-04-30"
  },
  "2025-04-30-desvendando-o-modelo-de-raciocinio-de-ia-de-codigo-aberto-da-xiaomi": {
    "intro": "Mais importante do que a notícia em si, é o impacto prático de Xiaomi unveils open-source AI reasoning model MiMo no nosso dia a dia como devs.",
    "data": "2025-04-30"
  },
  "2025-04-30-desvendando-os-segredos-do-xiaomi-mimo-reasoning-model": {
    "intro": "Existe uma armadilha técnica que muitos ignoram quando falamos de Xiaomi MiMo Reasoning Model.",
    "data": "2025-04-30"
  },
  "2025-04-30-desaceleracao-economica-nos-eua-oportunidades-e-desafios-para-desenvolvedores": {
    "intro": "Mais importante do que a notícia em si, é o impacto prático de U.S. Economy Contracts at 0.3% Rate in First Quarter no nosso dia a dia como devs.",
    "data": "2025-04-30"
  },
  "2025-04-30-desafios-da-logistica-como-a-reducao-de-35-no-volume-de-transporte-afeta-o-port-of-los-angeles": {
    "intro": "Tenho visto muita gente tratando Port of Los Angeles says shipping volume will plummet 35% next week como algo simples — mas a realidade é bem diferente.",
    "data": "2025-04-30"
  },
  "2025-04-30-sun-microsystems-40-anos-de-inovacao-e-legado-na-tecnologia": {
    "intro": "Mais importante do que a notícia em si, é o impacto prático de Joining Sun Microsystems – 40 years ago (2022) no nosso dia a dia como devs.",
    "data": "2025-04-30"
  }
}