{
  "2025-04-28-artigo-1.json": {
    "intro": "Já perdi as contas de quantas vezes vi desenvolvedores tropeçarem em __TEMATICA__..."
  },
  "2025-04-27-artigo-2.json": {
    "intro": "Essa notícia me fez refletir sobre como o mercado ainda lida mal com __TEMATICA__."
  },
  "2025-04-30-desvendando-o-mundo-da-derivacao-automatica-esparsa": {
    "intro": "A discussão sobre An illustrated guide to automatic sparse differentiation voltou à tona, e acredito que precisamos falar sobre isso com mais seriedade."
  },
  "2025-04-30-chatgpt-a-revolucao-na-busca-de-informacoes-online": {
    "intro": "Em um projeto antigo, enfrentei um problema parecido com o que essa notícia levanta...",
    "data": "2025-04-30"
  },
  "2025-04-30-performance-em-sistemas-desafios-e-estrategias-para-otimizacao": {
    "intro": "A discussão sobre Performance optimization is hard because it's fundamentally a brute-force task voltou à tona, e acredito que precisamos falar sobre isso com mais seriedade.",
    "data": "2025-04-30"
  },
  "2025-04-30-o-poder-oculto-da-sycophancy-no-universo-do-gpt-4o": {
    "intro": "Existe uma armadilha técnica que muitos ignoram quando falamos de Sycophancy in GPT-4o.",
    "data": "2025-04-30"
  },
  "2025-04-30-defendendo-uma-empresa-de-seguranca-cibernetica-desafios-e-estrategias-na-pratica": {
    "intro": "Sempre que vejo discussões sobre What It Takes to Defend a Cybersecurity Company from Today's Adversaries, lembro de uma situação real em produção...",
    "data": "2025-04-30"
  },
  "2025-04-30-hackeando-a-hacker-news-desvendando-os-segredos-dos-sistemas-modernos": {
    "intro": "Você já parou para pensar no impacto real de You Wouldn't Download a Hacker News nos sistemas modernos?",
    "data": "2025-04-30"
  },
  "2025-04-30-linux-e-excel-a-combinacao-que-vai-revolucionar-sua-produtividade": {
    "intro": "Tenho visto muita gente tratando Linux in Excel como algo simples — mas a realidade é bem diferente.",
    "data": "2025-04-30"
  },
  "2025-04-30-o-dilema-das-gemeas-do-meu-fermento-natural": {
    "intro": "Existe uma armadilha técnica que muitos ignoram quando falamos de My sourdough starter has twins.",
    "data": "2025-04-30"
  },
  "2025-04-30-explorando-a-aleatoriedade-nos-llms-desvendando-um-misterio-tecnico": {
    "intro": "Tenho visto muita gente tratando Can LLMs do randomness? como algo simples — mas a realidade é bem diferente.",
    "data": "2025-04-30"
  },
  "2025-04-30-a-revolucao-da-inteligencia-artificial-os-principais-eventos-no-campo": {
    "intro": "A discussão sobre AI TIMLINE – All prominent events in the field voltou à tona, e acredito que precisamos falar sobre isso com mais seriedade.",
    "data": "2025-04-30"
  },
  "2025-04-30-desvendando-o-modelo-de-raciocinio-de-ia-de-codigo-aberto-da-xiaomi": {
    "intro": "Mais importante do que a notícia em si, é o impacto prático de Xiaomi unveils open-source AI reasoning model MiMo no nosso dia a dia como devs.",
    "data": "2025-04-30"
  },
  "2025-04-30-desvendando-os-segredos-do-xiaomi-mimo-reasoning-model": {
    "intro": "Existe uma armadilha técnica que muitos ignoram quando falamos de Xiaomi MiMo Reasoning Model.",
    "data": "2025-04-30"
  },
  "2025-04-30-desaceleracao-economica-nos-eua-oportunidades-e-desafios-para-desenvolvedores": {
    "intro": "Mais importante do que a notícia em si, é o impacto prático de U.S. Economy Contracts at 0.3% Rate in First Quarter no nosso dia a dia como devs.",
    "data": "2025-04-30"
  },
  "2025-04-30-desafios-da-logistica-como-a-reducao-de-35-no-volume-de-transporte-afeta-o-port-of-los-angeles": {
    "intro": "Tenho visto muita gente tratando Port of Los Angeles says shipping volume will plummet 35% next week como algo simples — mas a realidade é bem diferente.",
    "data": "2025-04-30"
  },
  "2025-04-30-sun-microsystems-40-anos-de-inovacao-e-legado-na-tecnologia": {
    "intro": "Mais importante do que a notícia em si, é o impacto prático de Joining Sun Microsystems – 40 years ago (2022) no nosso dia a dia como devs.",
    "data": "2025-04-30"
  },
  "2025-04-30-youtube-a-vista-a-necessidade-de-oculos-de-alguem": {
    "intro": "A discussão sobre Someone at YouTube Needs Glasses voltou à tona, e acredito que precisamos falar sobre isso com mais seriedade.",
    "data": "2025-04-30"
  },
  "2025-04-30-wikipedia-e-inteligencia-artificial-uma-parceria-de-sucesso": {
    "intro": "Mais importante do que a notícia em si, é o impacto prático de Wikipedia says it will use AI, but not to replace human volunteers no nosso dia a dia como devs.",
    "data": "2025-04-30"
  },
  "2025-04-30-como-eu-criei-o-wiki-perfeito-e-alcancei-250-mil-em-receita-anual-sem-investidores": {
    "intro": "Sempre que vejo discussões sobre I created Perfect Wiki and reached $250k in annual revenue without investors, lembro de uma situação real em produção...",
    "data": "2025-04-30"
  },
  "2025-04-30-o-poder-oculto-de-deepseek-prover-v2-nos-sistemas-modernos": {
    "intro": "Você já parou para pensar no impacto real de DeepSeek-Prover-V2 nos sistemas modernos?",
    "data": "2025-04-30"
  },
  "2025-04-30-notebooklm-a-revolucao-da-audio-descricao-em-mais-de-50-idiomas": {
    "intro": "Tenho visto muita gente tratando NotebookLM Audio Overviews are now available in over 50 languages como algo simples — mas a realidade é bem diferente.",
    "data": "2025-04-30"
  },
  "2025-04-30-revolucao-na-computacao-desvendando-os-segredos-dos-links-e-pivos-mecanicos": {
    "intro": "Existe uma armadilha técnica que muitos ignoram quando falamos de Reversible computing with mechanical links and pivots.",
    "data": "2025-04-30"
  },
  "2025-04-30-criando-seu-proprio-modelo-de-ia-refinado-com-google-sheets-revolucione-seus-sistemas-modernos": {
    "intro": "Você já parou para pensar no impacto real de Show HN: Create your own finetuned AI model using Google Sheets nos sistemas modernos?",
    "data": "2025-04-30"
  },
  "2025-04-30-explorando-as-entranhas-do-linux-uma-analise-profunda-da-cve-2025-21756": {
    "intro": "A discussão sobre Linux Kernel Exploitation: CVE-2025-21756 voltou à tona, e acredito que precisamos falar sobre isso com mais seriedade.",
    "data": "2025-04-30"
  },
  "2025-04-30-ataque-vsock-desvendando-os-segredos-do-linux-kernel": {
    "intro": "Você já parou para pensar no impacto real de Linux Kernel Exploitation: Attack of the Vsock nos sistemas modernos?",
    "data": "2025-04-30"
  },
  "2025-04-30-mercury-a-revolucao-dos-modelos-de-linguagem-escalaveis": {
    "intro": "Sempre que vejo discussões sobre Mercury, the first commercial-scale diffusion language model, lembro de uma situação real em produção...",
    "data": "2025-04-30"
  },
  "2025-05-01-apple-condenada-por-violacao-antitruste-o-impacto-nos-desenvolvedores-e-consumidores": {
    "intro": "Tenho visto muita gente tratando Apple Violated Antitrust Ruling, Judge Finds como algo simples — mas a realidade é bem diferente.",
    "data": "2025-05-01"
  },
  "2025-05-01-explorando-as-vulnerabilidades-do-navegador-ladybird": {
    "intro": "Longe de ser novidade, o tema da notícia me trouxe à memória um erro clássico que vejo em consultorias.",
    "data": "2025-05-01"
  },
  "2025-05-01-milwaukee-o-grande-dilema-da-troca-de-dados-biometricos": {
    "intro": "Existe uma armadilha técnica que muitos ignoram quando falamos de Milwaukee police trade: 2.5M mugshots for free facial recognition access.",
    "data": "2025-05-01"
  },
  "2025-05-01-mercury-desvendando-o-futuro-da-linguagem-de-modelagem-em-escala-comercial": {
    "intro": "Tenho visto muita gente tratando Mercury: Commercial-scale diffusion language model como algo simples — mas a realidade é bem diferente.",
    "data": "2025-05-01"
  },
  "2025-05-01-a-revolucao-dos-108-bilhoes-de-pixels-desvendando-os-segredos-de-johannes-vermeer": {
    "intro": "Mais importante do que a notícia em si, é o impacto prático de 108B Pixel Scan of Johannes Vermeer's Girl with a Pearl Earring no nosso dia a dia como devs.",
    "data": "2025-05-01"
  },
  "2025-05-01-web-browsers-a-crise-financeira-por-tras-dos-favoritos-dos-internautas": {
    "intro": "A discussão sobre All four major web browsers are about to lose 80% of their funding voltou à tona, e acredito que precisamos falar sobre isso com mais seriedade.",
    "data": "2025-05-01"
  },
  "2025-05-01-esp32-c5-da-espressif-a-revolucao-silenciosa-que-esta-por-vir": {
    "intro": "Sempre que vejo discussões sobre Espressif's ESP32-C5 Is Now in Mass Production, lembro de uma situação real em produção...",
    "data": "2025-05-01"
  },
  "2025-05-01-dropbox-e-o-suporte-ao-app-indicator-no-linux-rumo-a-integracao-perfeita": {
    "intro": "Sempre que vejo discussões sobre Dropbox will require App Indicator support on Linux, lembro de uma situação real em produção...",
    "data": "2025-05-01"
  },
  "2025-05-01-desafio-como-a-microsoft-esta-transformando-o-office-para-carregar-mais-rapido-no-windows-startup": {
    "intro": "Você já parou para pensar no impacto real de Office is too slow, so Microsoft is making it load at Windows startup nos sistemas modernos?",
    "data": "2025-05-01"
  },
  "2025-05-01-hackeando-a-comunicacao-como-o-secretario-de-defesa-dos-eua-dribla-equipamentos-oficiais-do-dod": {
    "intro": "Tenho visto muita gente tratando How the US defense secretary circumvents official DoD communications equipment como algo simples — mas a realidade é bem diferente.",
    "data": "2025-05-01"
  },
  "2025-05-01-independencia-tecnologica-na-europa-despertando-o-gigante-adormecido-da-inovacao": {
    "intro": "Sempre que vejo discussões sobre Microsoft gets twitchy over talk of Europe's tech independence, lembro de uma situação real em produção...",
    "data": "2025-05-01"
  },
  "2025-05-01-a-revolucao-da-copia-de-bancos-de-dados-sqlite": {
    "intro": "A discussão sobre A faster way to copy SQLite databases between computers voltou à tona, e acredito que precisamos falar sobre isso com mais seriedade.",
    "data": "2025-05-01"
  },
  "2025-05-01-o-dia-do-trabalho-uma-breve-historia-e-suas-licoes-para-a-tecnologia-moderna": {
    "intro": "Sempre que vejo discussões sobre The Brief Origins of May Day, lembro de uma situação real em produção...",
    "data": "2025-05-01"
  }
}